{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "dtype": "float32", "data_format": "channels_last", "cropping": [[70, 25], [0, 0]]}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxMAAAB0AABqAQBqAgB8AABkAwCDAgBTKQRO6SgAAADpoAAA\nACkCcgEAAAByAgAAACkD2gJ0ZtoFaW1hZ2XaDXJlc2l6ZV9pbWFnZXMpAXIEAAAAqQByBgAAAPoI\nbW9kZWwucHnaCDxsYW1iZGE+XwAAAHMAAAAA\n", null, null], "arguments": {}}}, {"class_name": "Lambda", "config": {"output_shape": null, "trainable": true, "batch_input_shape": [null, 40, 160, 3], "function_type": "lambda", "name": "lambda_2", "output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgX0DnAAAAAAAA\n8D+pACkB2gF4cgMAAAByAwAAAPoIbW9kZWwucHnaCDxsYW1iZGE+YQAAAHMAAAAA\n", null, null], "dtype": "float32", "arguments": {}}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "conv2d_1", "filters": 24, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [1, 1], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "conv2d_2", "filters": 36, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "strides": [1, 1], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_size": [5, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "conv2d_3", "filters": 48, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "strides": [1, 1], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "conv2d_4", "filters": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "trainable": true, "strides": [1, 1], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "name": "conv2d_5", "filters": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_5", "trainable": true, "strides": [1, 1], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "units": 1164, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "units": 100, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "units": 50, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "units": 10, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "units": 1, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}]}}